Esercizi/PECCIOLI_TDI_Foglio4.org
#+title: Esercizi TDI - Foglio 4
#+date: 12 maggio 2025
#+OPTIONS: toc:nil
#+LATEX_HEADER: \renewcommand{\href}[2]{#2}
#+LATEX_HEADER: \renewcommand{\theenumi}{\alph{enumi}}


* Esercizio 1

Prove that for any [[id:c0d47e62-8d50-44c0-984a-c115c0ea2c40][Polish space]] \(X\) and \(x \in X\), the singleton \(\{x\}\) is \(\bm{\Pi}^0_1\)-complete if and only if \(x\) is not [[id:0140c3b7-d824-479f-ae94-d0a59da89e96][isolated]] in \(X\). Conclude that the set
\[
  C_1 = \{x \in 2^\omega \mid \exists n \ (x(n) = 0)\}
\]
from Proposition 2.1.31 of the notes is \(\bm{\Sigma}^0_1\)-complete.

** Soluzione

Siccome \(X\) è uno spazio metrizzabile, allora \(\set{x} \subseteq X\) è chiuso, e pertanto \(\set{x} \in \bm{\Pi_{1}}^{0}(X)\). Bisogna quindi dimostrare che \(\set{x}\) è \(\bm{\Pi}^{0}_{1}\)-hard sse \(x\) è *non isolato* in \(X\).

*** Implicazione "\(\implies\)"

Sia \(C \in \bm{\Pi}_{1}^{0}(\omega^{\omega})\), e sia \(f: \omega^{\omega}\to X\) continua tale che
\begin{equation*}
f^{-1}(x) = C.
\end{equation*}

Si supponga per assurdo che \(x\) sia isolato. Allora \(\set{x} \subseteq X\) è aperto, e quindi \(C \subseteq \omega^{\omega}\) è aperto (retroimmagine continua di un aperto).

Per l'arbitrarietà di \(C\), questo implica che ogni chiuso di \(\omega^{\omega}\) è un clopen. Inoltre, se \(A \subseteq \omega^{\omega}\) è aperto, allora \(\omega^{\omega}\setminus A\) è chiuso e quindi clopen, e pertanto \(A\) è un chiuso:
\begin{equation*}
\bm{\Sigma}_{1}^{0}(\omega^{\omega}) = \bm{\Delta}_{1}^{0}(\omega^{\omega}) = \bm{\Pi}_{1}^{0}(\omega^{\omega}).
\end{equation*}
Questo contraddice il Theorem 2.1.17 delle note.


