Esercizi/PECCIOLI_TDI_Foglio4.org
*** Implicazione "\(\impliedby\)" :Modificato:

Sia \(x \in X\) un punto non isolato, ovvero \(x\) un punto di accumulazione di \(X\), e sia \(B \in \bm{\Pi}_{1}^{0}(\omega^{\omega})\).

- Si fissi \(d:X\to \R\) una metrica completa su \(X\).
- Siccome \(x\) è un punto di accumulazione di \(X\), allora esiste una successione \((y_{n})_{n \in \omega} \subseteq X\setminus\set{x}\) tale che \(y_{n}\to x\), ovvero, per ogni intorno \(U\) di \(x\) esiste \(N \in \N\) tale che, per ogni \(j\ge N\), \(y_{j} \in U\).
  # Sia ora \(y \in X\setminus\set{x}\), e sia \(d\) la metrica normalizzata:
  # \begin{equation*}
  #       	d(i,j) \coloneqq \frac{d'(i,j)}{d'(x,y)}
  # \end{equation*}
  # Dunque esiste un punto \(y_{0} \in X\) tale che \(d(x,y_{0})=1\).

- Si costruisce \(\set{U_{n}}_{n \in \omega}\) una famiglia di aperti di \(X\) tali che
  - per ogni \(n \in \omega\): \(U_{n}\setminus \set{x}\neq \emptyset\);
  - l'intersezione \(\bigcap_{n \in \omega} U_{n} = \set{x}\);
  - \(\operatorname{diam}(U_{n})\to 0\);
  - per ogni \(n \in \omega\): \(\operatorname{Cl}(U_{n+1}) \subsetneqq U_{n}\)
  e una successione \(v_{n} \subseteq X\setminus \set{x}\) tale che \(v_{n} \in U_{n}\setminus \operatorname{Cl}(U_{n+1})\).

  # Poiché \(X\) è T1, allora ogni intorno di \(x\) ha una quantità infinita di punti, poiché punto di accumulazione, ed è sufficiente costruire gli intorni per induzione.

  Sia \(U_{0} = X\). Si supponga di aver costruito \(U_{n}\), e sia \(\alpha \in U_{n}\setminus\set{x}\). Tale \(\alpha\) esiste, poiché esistono infiniti elementi della successione \((y_{j})_{j \in \omega}\) dentro \(U_{n}\) intorno di \(x\).

  Detto \(r\coloneqq\min\set{2^{-n-1}, d(x,\alpha)/2}>0\), sia \(U_{n}'\coloneqq B_{d}(x,r)\). Necessariamente \(\alpha\notin U_{n}'\) e \(U_{n}' \subsetneqq U_{n}\).

  È quindi possibile porre \(U_{n+1}\coloneqq B_{d}(x,r/2)\):
  \begin{equation*}
		\operatorname{Cl}(U_{n+1}) = \operatorname{Cl} \left(B_{d}(x,r/2)\right) \subseteq B_{d}^{\text{cl}}(x,r/2) \subseteq B_{d}(x,r) = U_{n}' \subsetneqq U_{n}.
  \end{equation*}

  Si ponga inoltre \(v_{n} \coloneqq \alpha\), \(v_{n} \in U_{n}\setminus \operatorname{Cl}(U_{n+1})\).

  Questa famiglia soddisfa tutte le proprietà elencate.
# - Sia ora \(\set{V_{n}}_{n \in \omega}\) una famiglia di aperti non vuoti di \(X\) tali che, per ogni \(n \in \omega\)
#   \begin{equation*}
# 		\operatorname{Cl}(V_{0}) \subseteq X\setminus \operatorname{Cl}(U_{0}),\qquad \operatorname{Cl}(V_{n+1}) \subseteq U_{n}\setminus \operatorname{Cl}(U_{n+1}).
#   \end{equation*}

#   Tali \(V_{n}\) esistono. Infatti, entrambi i seguenti insiemi sono aperti non vuoti
#   \begin{equation*}
# 		X\setminus \operatorname{Cl}(U_{0}), \qquad U_{n}\setminus \operatorname{Cl}(U_{n+1}) =  U_{n}\cap \left(X\setminus \operatorname{Cl}(U_{n+1})\right)
#   \end{equation*}
#   e pertanto contengono una palla aperta \(B_{d}(\alpha,\delta)\). È sufficiente considerare, quindi, l'insieme \(B_{d}(\alpha, \delta/2)\ni\alpha\) poiché, come sopra:
#   \begin{equation*}
# 		\operatorname{Cl}\left(B_{d}(\alpha, \delta/2)\right) \subseteq B_{d}(\alpha,\delta)
#   \end{equation*}

# - Per ogni \(n \in \omega\), sia \(\set{W_{j}^{n}}_{j \in\omega}\) una famiglia di aperti non vuoti tale che, per ogni \(j \in \omega\)
#   \begin{equation*}
# 		\operatorname{Cl}(W_{j}^{n}) \subseteq V_{n},\qquad \operatorname{Cl}(W_{j+1}^{n}) \subseteq W_{j}^{n}.
#   \end{equation*}

#   Tali \(W_{j}^{n}\) esistono. Infatti, siccome \(V_{n}\) è aperto non vuoto, allora esiste \(\alpha \in V_{n}\) ed esiste \(\delta \in (0,1)\) tale che
#   \begin{equation*}
# 		B_{d}(\alpha,\delta) \subseteq V_{n}
#   \end{equation*}
#   Come sopra, ponendo \(W_{j}^{n} \coloneqq B_{d}(\alpha,\delta\cdot 2^{-n-2})\) si ottengono gli aperti cercati. Ciascun \(W_{j}^{n}\ni \alpha\).

- Siccome \(B\) è un chiuso di \(\omega^{\omega}\), allora esiste un albero potato \(T \subseteq \omega^{<\omega}\) tale che \(B=[T]\), i.e.
  \begin{equation*}
		B = \set{\alpha \in \omega^{\omega}\mid \forall\,n \in \omega\ (\alpha\upharpoonright n \in T)}
  \end{equation*}
- Si costruisce un \(\omega\)-schema \(\set{B_{s}\mid s \in \omega^{<\omega}}\) su \(X\):
  - se \(s \in T\), allora \(B_{s} \coloneqq U_{\operatorname{lh}(s)}\); in particolare, quindi \(\emptyset \in T\) e \(B_{\emptyset} = U_{0} = X\);
  - se \(s\notin T\), sia \(j_{s}\) il più grande indice tale che \(s\upharpoonright j_{s} \in T\); si pone \(B_{s} \coloneqq \set{v_{j_{s}}}\).
- Questo definisce effettivamente uno schema tale che \(\operatorname{Cl}(B_{s\concat a}) \subseteq B_{s}\) e ciascun \(B_{s}\neq \emptyset\): pertanto è indotta una funzione continua totale (per il Lemma 1.3.6)
  \begin{equation*}
		F:\omega^{\omega}\to X
  \end{equation*}
- Resta da mostrare che \(F^{-1}(x) = B\). Questo per definizione garantisce che \(\set{x}\) sia un \(\bm{\Pi}_{1}^{0}\)-hard.

  Per ogni \(\beta \in B\),
  \begin{equation*}
		F(\beta) \in \bigcap_{n \in \omega} B_{\beta\upharpoonright n}
  \end{equation*}
  dove \(\beta\upharpoonright n \in T\). Quindi \(B_{\beta\upharpoonright n} = U_{n}\). Quindi
  \begin{equation*}
		F(\beta) \in \bigcap_{n \in \omega} U_{n} = \set{x}.
  \end{equation*}

  Viceversa, se \(\beta \notin B\), allora esiste \(n_{0} \in \omega\) tale che \(\beta\upharpoonright n_{0} \notin T\) e pertanto
  \begin{equation*}
		F(\beta) \in \bigcap_{n \in\omega} B_{\beta\upharpoonright n} \subseteq B_{\beta\upharpoonright n_{0}}
  \end{equation*}
  e per costruzione \(x\notin B_{\beta\upharpoonright n_{0}}\).


**** Stupidate :noexport:
- Sia \(\set{U_{j}}_{j \in \omega}\) una famiglia numerabile di chiusi di \(\omega^{\omega}\) tali che:
  - per ogni \(i\neq j\): \(U_{i}\cap U_{j} = B\);
  - \(\bigcup_{j \in \omega} U_{j} = \omega^{\omega}\).

  Tale famiglia esiste perché BLA BLA BLA
- Sia \((x_{j})_{j \in\omega}\) una successione di \(X\) _convergente a \(x\)_, tale che, per ogni \(j \in \omega\), \(x_{j}\neq x\). Tale successione esiste poiché \(x\) è un punto di accumulazione per \(X\).
- Si definisce pertanto una funzione \(F:\omega^{\omega}\to X\) come segue:
  \begin{equation*}
		F(\alpha) = \begin{cases}
			x & \alpha \in B\\
			x_{j} & \alpha \in U_{j}\setminus B
		\end{cases}
  \end{equation*}
  - Chiaramente \(F^{-1}(x) = B\) per costruzione.
  - Per dimostrare la continuità, si consideri un qualsiasi chiuso \(C \subseteq X\).

Si vuole costruire una funzione \(F:\omega^{\omega}\to X\) tale che \(F^{-1}(x) = B\).

IDEA: Se \(x\) è di accumulazione allora esiste una successione \(x_{n}\to x\). Si suddivide \(\omega^{\omega}\) in una quantità numerabile di clopen disgiunti \((A, A_n)\), in modo tale che \(A \subseteq B\). Allora si pone, per ogni \(n \in \omega\), \(F(A_{n}) = \set{x_{n}}\). Devo ancora riuscire a distinguere \(B\) da \(A\).

**** Roba sbagliata 4 :noexport:

Si supponga per assurdo che \(\set{x}\) non sia un \(\bm{\Pi}_{1}^{0}\)-hard. Allora esiste \(B \in \bm{\Pi}_{1}^{0}(\omega^{\omega})\) tale che per ogni funzione continua da \(\omega^{\omega}\) in \(x\), la controimmagine di \(\set{x}\) sia _diversa_ da \(B\).

VOGLIO DIMOSTRARE CHE \(\set{x}\) SIA APERTO.

**** Roba sbagliata 1 :noexport:

In particolare, sia \(F:\omega^{\omega}\to X\) una funzione continua fissata tale che \(F^{-1}(x)\cap B\neq \emptyset\). **DIMOSTRARE CHE ESISTA**

Si consideri quindi \(B\setminus F^{-1}(x)\neq\emptyset\). Necessariamente **DIMOSTRARE**
\begin{equation*}
\operatorname{Cl}\left(B\setminus F^{-1}(x)\right)\cap F^{-1}(x) \neq \emptyset
\end{equation*}

Sia quindi \(\alpha \in \operatorname{Cl}\left(B\setminus F^{-1}(x)\right)\cap F^{-1}(x)\). Allora esiste una successione \((\beta_{n})_{n \in \omega} \subseteq B\setminus F^{-1}(x)\) tale che
\begin{equation*}
\beta_{n}\to \alpha \in F^{-1}(x).
\end{equation*}

Siccome \(F\) è continua, allora, \(F(\beta_{n})\to F(\alpha)=x\), con \(F(\beta_{n})\neq x\). Pertanto \(x\) è un punto di accumulazione di \(X\), e quindi \(x\) non è un punto isolato.

**** Roba sbagliata 2 :noexport:

# Siccome \(X\setminus\set{x}\) è un aperto di \(X\), allora è uno spazio polacco. Pertanto esiste una funzione continua
# \begin{equation*}
# \psi: \omega^{\omega}\to X\setminus\set{x}
# \end{equation*}

# Si definisce allora la funzione \(f_{B}:\omega^{\omega}\to X\) definita come segue: per ogni \(b \in \omega^{\omega}\):
# \begin{equation*}
# f_{B}(b) = \begin{cases}
# x & b \in B\\
# \psi(b) & b \notin B.
# \end{cases}
# \end{equation*}

# Allora:
# - \(B=f^{-1}_{B}(x)\);
# - \(f_{B}\) è una funzione continua: infatti, se \(C \subseteq X\) è chiuso:
#   - se \(x \notin C\) allora, \(f_{B}^{-1}(C) = \psi^{-1}(C)\cap (X\setminus B)\)

#      chiuso, poiché \(\psi\) è continua e \(C \subseteq X\setminus\set{x}\) è chiuso;
#   - se \(x \in C\) allora
#     \begin{equation*}
# 		f^{-1}_{B}(C) = B\cup \psi^{-1}(C\setminus\set{x})
#     \end{equation*}
#     è chiuso, poiché \(B\) è chiuso per ipotesi, e \(C\setminus\set{x} = C\cap (X\setminus\set{x})\) è un chiuso di \(X\setminus \set{x}\) e \(\psi\) è continua.



*** Insieme \(C_{1}\)

Dal momento che \(\bm{\Sigma}_{1}^{0} = \check{\bm{\Pi}}_{1}^{0}\) segue che \(C_{1}\) è \(\bm{\Sigma}_{1}^{0}\)-completo se e solo se \(2^{\omega}\setminus C_1\) è \(\bm{\Pi}_{1}^{0}\)-completo.

Si ha che \(x \in 2^{\omega}\setminus C_{1}\) se e solo se per ogni \(n \in \omega\), \(x(n)\neq 0\), ovvero \(x(n)=1\).

Pertanto \(2^{\omega}\setminus C_{1} =  \set{u}\), dove
\begin{align*}
u: \omega &\longrightarrow 2\\
n &\longmapsto 1
\end{align*}

Per la caratterizzazione di cui sopra, \(C_{1}\) è \(\bm{\Sigma}_{1}^{0}\)-completo se e solo se \(u\) non è un punto isolato di \(2^{\omega}\).

Si consideri ora la successione \((x_{n})_{n \in \omega} \subseteq 2^{\omega}\):
\begin{equation*}
x_{n}(j) = \begin{cases}
1 & j<n\\
0 &j\ge n
\end{cases}
\end{equation*}
Si ha che \(x_{n}\to u\), e pertanto \(u\) non è un punto isolato di \(2^{\omega}\) (per ogni intorno \(I\) di \(u\) esiste \(N \in \omega\) tale che \(x_{N} \in I\setminus\set{u}\)). \qed


* Esercizio 2

Prove that for any Polish space and $A \subseteq X$, if $A$ is not open then it is \(\bm{\Pi}_{1}^{0}\)-hard. Conclude that a set $A$ is truly closed (i.e. closed but not open) if and only if it is \(\bm{\Pi}_{1}^{0}\)-complete, and similarly for \(\bm{\Sigma}_{1}^{0}\).

** Soluzione

