Esercizi/PECCIOLI_TDI_Foglio4.org
*** Non aperti sono \(\mathbf{\Pi}_{1}^{0}\)-hard :Modificato:

Sia \(A\) un insieme non aperto, e sia \(C \subseteq \omega^{\omega}\) un chiuso fissato.

Sia dunque \(a_{0} \in A\setminus \operatorname{Int}(A)\). In particolare, quindi \(a_{0} \in \operatorname{Cl}(X\setminus A) \supseteq A\setminus \operatorname{Int}(A)\).

- Si fissi \(d:X\to \R\) una metrica completa su \(X\).
- Siccome \(a_{0} \in \operatorname{Cl}(X\setminus A)\), allora esiste una successione \((y_{n})_{n \in \omega} \subseteq X\setminus A\) tale che \(y_{n}\to a_{0}\), ovvero, per ogni intorno \(U\) di \(a_{0}\) esiste \(N \in \N\) tale che, per ogni \(j\ge N\), \(y_{j} \in U\).
- Si costruisce \(\set{U_{n}}_{n \in \omega}\) una famiglia di aperti di \(X\) tali che
  - per ogni \(n \in \omega\): \(U_{n}\setminus \set{a_{0}}\neq \emptyset\);
  - l'intersezione \(\bigcap_{n \in \omega} U_{n} = \set{a_{0}}\);
  - \(\operatorname{diam}(U_{n})\to 0\);
  - per ogni \(n \in \omega\): \(\operatorname{Cl}(U_{n+1}) \subsetneqq U_{n}\)
  e una successione \(v_{n} \subseteq X\setminus A\) tale che \(v_{n} \in U_{n}\setminus \operatorname{Cl}(U_{n+1})\).

  Sia \(U_{0} = X\). Si supponga di aver costruito \(U_{n}\), e sia \(\alpha \in U_{n}\setminus A\). Tale \(\alpha\) esiste, poiché esistono infiniti elementi della successione \((y_{j})_{j \in \omega}\) dentro \(U_{n}\) intorno di \(a_{0}\), e tutti questi elementi _non appartengono ad \(A\)_.

  Detto \(r\coloneqq\min\set{2^{-n-1}, d(a_{0},\alpha)/2}>0\), sia \(U_{n}'\coloneqq B_{d}(a_{0},r)\). Necessariamente \(\alpha\notin U_{n}'\) e \(U_{n}' \subsetneqq U_{n}\).

  È quindi possibile porre \(U_{n+1}\coloneqq B_{d}(a_{0},r/2)\):
  \begin{equation*}
		\operatorname{Cl}(U_{n+1}) = \operatorname{Cl} \left(B_{d}(a_{0},r/2)\right) \subseteq B_{d}^{\text{cl}}(a_{0},r/2) \subseteq B_{d}(a_{0},r) = U_{n}' \subsetneqq U_{n}.
  \end{equation*}

  Si ponga inoltre \(v_{n} \coloneqq \alpha\), \(v_{n} \in U_{n}\setminus \operatorname{Cl}(U_{n+1})\), \(v_{n}\notin A\).

  Questa famiglia soddisfa tutte le proprietà elencate.

- Siccome \(C\) è un chiuso di \(\omega^{\omega}\), allora esiste un albero potato \(T \subseteq \omega^{<\omega}\) tale che \(C=[T]\), i.e.
  \begin{equation*}
		C= \set{\alpha \in \omega^{\omega}\mid \forall\,n \in \omega\ (\alpha\upharpoonright n \in T)}
  \end{equation*}
- Si costruisce un \(\omega\)-schema \(\set{B_{s}\mid s \in \omega^{<\omega}}\) su \(X\):
  - se \(s \in T\), allora \(B_{s} \coloneqq U_{\operatorname{lh}(s)}\); in particolare, quindi \(\emptyset \in T\) e \(B_{\emptyset} = U_{0} = X\);
  - se \(s\notin T\), sia \(j_{s}\) il più grande indice tale che \(s\upharpoonright j_{s} \in T\); si pone \(B_{s} \coloneqq \set{v_{j_{s}}}\).
- Questo definisce effettivamente uno schema tale che \(\operatorname{Cl}(B_{s\concat a}) \subseteq B_{s}\) e ciascun \(B_{s}\neq \emptyset\): pertanto è indotta una funzione continua totale (per il Lemma 1.3.6)
  \begin{equation*}
		F:\omega^{\omega}\to X
  \end{equation*}
- Resta da mostrare che \(F^{-1}(A) = C\). Questo per definizione garantisce che \(A\) sia un \(\bm{\Pi}_{1}^{0}\)-hard.

  Per ogni \(\beta \in C\),
  \begin{equation*}
		F(\beta) \in \bigcap_{n \in \omega} B_{\beta\upharpoonright n}
  \end{equation*}
  dove \(\beta\upharpoonright n \in T\). Quindi \(B_{\beta\upharpoonright n} = U_{n}\). Quindi
  \begin{equation*}
		F(\beta) \in \bigcap_{n \in \omega} U_{n} = \set{a_{0}} \subseteq A.
  \end{equation*}

  Viceversa, se \(\beta \notin C\), allora esiste \(n_{0} \in \omega\) tale che \(\beta\upharpoonright n_{0} \notin T\) e pertanto
  \begin{equation*}
		F(\beta) \in \bigcap_{n \in\omega} B_{\beta\upharpoonright n} \subseteq B_{\beta\upharpoonright n_{0}}
  \end{equation*}
  e per costruzione, siccome \(B_{\beta\upharpoonright n_{0}} = \set{v_{m}}\) per qualche \(m \in \omega\), e \(v_{m}\notin A\) per costruzione, allora
  \begin{equation*}
		A\cap B_{\beta\upharpoonright n_{0}} = \emptyset
  \end{equation*}
  e pertanto \(F(\beta)\notin A\).

**** Da aggiungere :noexport:
Si fissi \(d':X\to \R\) una metrica completa su \(X\). Sia ora \(y \in X\setminus A\), e sia \(d\) la metrica normalizzata:
\begin{equation*}
d(i,j) \coloneqq \frac{d'(i,j)}{d'(a_{0},y)}
\end{equation*}
Dunque esiste un punto \(y \in X\) tale che \(d(a_{0},y)=1\).

- Sia \(\set{U_{n}}_{n \in \omega}\) una famiglia di aperti di \(X\) tali che
  - per ogni \(n \in \omega\): \(U_{n}\setminus \set{x}\neq \emptyset\);
  - l'intersezione \(\bigcap_{n \in \omega} U_{n} = \set{a_{0}}\);
  - \(\operatorname{diam}(U_{n})\to 0\);
  - per ogni \(n \in \omega\): \(\operatorname{Cl}(U_{n+1}) \subsetneqq U_{n}\).
  Tale famiglia esiste, come dimostrato nel punto precedente. In particolare, si prenda \(U_{0}=B_{d}(a_{0},1/2)\).
- Sia ora \(\set{V_{n}}_{n \in \omega}\) una famiglia di chiusi non vuoti, con /vanishing diameter/, di \(X\) tali che, per ogni \(n \in \omega\)
  \begin{equation*}
		\operatorname{Cl}(V_{0}) \subseteq X\setminus \operatorname{Cl}(U_{0}),\qquad \operatorname{Cl}(V_{n+1}) \subseteq U_{n}\setminus \operatorname{Cl}(U_{n+1}).
  \end{equation*}
  e tali che \(V_{n}\cap A = \emptyset\). È sufficiente considerare \(V_{n}\) come un singoletto.
- Siccome \(C\) è un chiuso di \(\omega^{\omega}\), allora esiste un albero potato \(T \subseteq \omega^{<\omega}\) tale che \(C=[T]\), i.e.
  \begin{equation*}
		C = \set{\alpha \in \omega^{\omega}\mid \forall\,n \in \omega\ (\alpha\upharpoonright n \in T)}
  \end{equation*}
- Si costruisce un \(\omega\)-schema \(\set{B_{s}\mid s \in \omega^{<\omega}}\) su \(X\):
  - sia \(B_{\emptyset} \coloneqq X\);
  - se \(s \in T\), allora \(B_{s} \coloneqq U_{\operatorname{lh}(s)}\);
  - se \(s\notin T\), sia \(j_{s}\) il più grande indice tale che \(s\upharpoonright j_{s} \in T\); si pone \(B_{s} \coloneqq V_{j_{s}}\).
- Questo definisce effettivamente uno schema tale che \(\operatorname{Cl}(B_{s\concat a}) \subseteq B_{s}\) e ciascun \(B_{s}\neq \emptyset\): pertanto è indotta una funzione continua totale (per il Lemma 1.3.6)
  \begin{equation*}
		F:\omega^{\omega}\to X
  \end{equation*}
- Resta da mostrare che \(F^{-1}(A) = C\). Questo per definizione garantisce che \(A\) sia un \(\bm{\Pi}_{1}^{0}\)-hard.

  Per ogni \(\beta \in C\),
  \begin{equation*}
		F(\beta) \in \bigcap_{n \in \omega} B_{\beta\upharpoonright n}
  \end{equation*}
  dove \(\beta\upharpoonright n \in T\). Quindi \(B_{\beta\upharpoonright n} = U_{n}\). Quindi
  \begin{equation*}
		F(\beta) \in \bigcap_{n \in \omega} U_{n} = \set{a_{0}} \subseteq A.
  \end{equation*}

  Viceversa, se \(\beta \notin C\), allora esiste \(n_{0} \in \omega\) tale che \(\beta\upharpoonright n_{0} \notin T\) e pertanto
  \begin{equation*}
		F(\beta) \in \bigcap_{n \in\omega} B_{\beta\upharpoonright n} \subseteq B_{\beta\upharpoonright n_{0}}
  \end{equation*}
  e per costruzione, siccome \(B_{\beta\upharpoonright n_{0}}\) è contenuto in qualche \(V_{m}\), \(A\cap B_{\beta\upharpoonright n_{0}} = \emptyset\), e pertanto \(F(\beta)\notin A\)

**** Minchiatissime :noexport:

Per l'esercizio precedente, siccome \(a_{0}\) è un punto non isolato di \(X\) (altrimenti \(\set{a_{0}}\) aperto, e quindi \(a_{0} \in \operatorname{Int}(A)\)), allora \(\set{a_{0}}\) è un insieme \(\bm{\Pi}_{1}^{0}\)-hard.

È necessario trovare una funzione continua \(F:X\to X\) tale che \(F^{-1}(A)=\set{x}\). Questo garantisce che \(A\) sia un insieme \(\bm{\Pi}_{1}^{0}\)-hard, per mezzo del Lemma 2.1.23.

- Sia \((y_{n})_{n \in \omega}\) una successione in \(X\setminus A\) convergente ad \(a_{0}\) (che esiste poiché \(a_{0} \in \operatorname{Cl}(X\setminus A)\)).
- Siccome \(X\) è uno spazio polacco, esiste una metrica completa \(d:X\to \R\) tale che per ogni \(x,y \in X\), \(d(x,y)<1\).

  Poiché \(y_{n}\to a_{0}\), allora per ogni \(\varepsilon>0\) esiste \(N \in \N\) tale che, per ogni \(n\ge N\), \(d(y_{n},a_{0})<\varepsilon\).

  È ben definita, quindi, la funzione \(\eta:X\setminus\set{a_{0}}\to \N\):
  \begin{equation*}
		\eta(x)\coloneqq \min\set{n \in \N\mid d(y_{n}, a_{0})< \frac{1}{2}d(x,a_{0})}
  \end{equation*}

  _Claim_: \(\eta\) è una funzione continua.

  Fissato \(x \in X\), sia \(k = \eta(x)\), e siano:
  \begin{align*}
		\delta&\coloneqq d(x,a_{0})\\
		m &\coloneqq \min_{j<k} \set{d(y_{j}, a_{0})}.
  \end{align*}
  Necessariamente \(m\ge \frac{1}{2} \delta\). Si distinguono due casi

  - _Se \(m>\frac{1}{2}\delta\)_:

    Poiché \(d(\cdot, a_{0})\) è una funzione continua, per ogni \(\varepsilon>0\) esiste un intorno \(U_{\varepsilon}\) di \(x\) tale che, per ogni \(z \in U_{\varepsilon}\),
    \begin{equation*}
		|d(z,a_{0})-d(x,a_{0})|<\varepsilon
    \end{equation*}
    ovvero \(d(z,a_{0}) \in (\delta-\varepsilon,\delta+\varepsilon)\).

    Si scelga \(\varepsilon = \min\set{\delta - 2d(y_{k},a_{0}), 2m-\delta}>0\). Sia \(z \in U_{\varepsilon}\) fissato, per \(\varepsilon\). Si dimostra che \(\eta(z) = k =\eta(x)\), ovvero che \(\eta(U_{\varepsilon}) = \set{k}\). Questo implica la continuità di \(\eta\).

    Si ha che:
    \begin{align*}
		\varepsilon &\le \delta-2d(y_{k},a_{0})\\
		-\varepsilon &\ge -\delta+2d(y_{k},a_{0})\\
		\delta-\varepsilon &\ge 2d(y_{k},a_{0})
    \end{align*}
    e pertanto
    \begin{equation*}
		d(z,a_{0}) > \delta-\varepsilon \ge 2d(y_{k},a_{0})
    \end{equation*}
    e pertanto
    \begin{equation*}
		d(y_{k},a_{0}) < \frac{1}{2} d(z,a_{0}).
    \end{equation*}

    Inoltre, per ogni \(j<k\):
    \begin{align*}
		\varepsilon &\le 2m-\delta\\
		\delta+\varepsilon &\le 2m \le 2d(y_{j}, a_{0})
    \end{align*}
    e pertanto
    \begin{equation*}
		d(z,a_{0}) < \delta+\varepsilon \le 2d(y_{j}, a_{0})
    \end{equation*}
    e quindi, per ogni \(j<k\)
    \begin{equation*}
		d(y_{j},a_{0}) \ge \frac{1}{2} d(z,a_{0})
    \end{equation*}

    Si è quindi dimostrato che \(\eta(z)=k\).
  - _Se \(2m-\delta=0\)_

    Poiché \(d(\cdot, a_{0})\) è una funzione continua, per ogni \(\varepsilon > 0\) esiste un intorno

- Si definisce infine \(F:X\to X\) come segue:
  \begin{equation*}
		F(x) \coloneqq \begin{cases}
			a_{0} &\text{se }x = a_{0}\\
			y_{\eta(x)} &\text{se }x\neq a_{0}
		\end{cases}
  \end{equation*}
  Questa funzione ha le caratteristiche richieste.
  - Ovviamente \(F^{-1} (A) = \set{a_{0}}\). Infatti \(F(a_{0}) = a_{0} \in A\), e inoltre, siccome per ogni \(n \in\omega\) si ha \(y_{n}\neq a_{0}\), se \(F(\alpha)=a_{0}\) allora \(\alpha=a_{0}\).

  - Inoltre, \(F\) è continua. Infatti, sia \(D \subseteq X\) un qualsiasi aperto. Siccome
    \begin{equation*}
		F^{-1}(D) = \bigcup_{y \in D} F^{-1}(y) = \bigcup_{\substack{y \in D\\ y=a_{0}, y_{n}}} F^{-1}(y)
    \end{equation*}
    è sufficiente dimostrare che per ogni \(n \in \omega\) l'insieme \(F^{-1}(y_{n})\) è aperto.

    Ma \(F^{-1}(y_{n}) = \eta^{-1}(n)\), dunque, siccome \(\N\) ha la topologia discreta e \(\eta\) è continua, \(F^{-1}(y_{n})\) è aperto di \(X\setminus\set{a_{0}}\), e quindi aperto di \(X\).

