Esercizi/PECCIOLI_TDI_Foglio4.tex
\subsubsection{Caratterizzazione dei chiusi ma non aperti}
\label{sec:orgfe296a3}

\begin{itemize}
\item Se \(A\) è chiuso ma non aperto, allora \(A\) è \(\bm{\Pi}_{1}^{0}\)-hard e inoltre \(A \in \bm{\Pi}_{1}^{0}\). Per definizione, quindi \(A\) è un \(\bm{\Pi}_{1}^{0}\)-completo.

Viceversa, se \(A\) è un chiuso \(\bm{\Pi}_{1}^{0}\)-hard, si supponga per assurdo che sia aperto. Allora, per ogni \(B \in \bm{\Pi}_{1}^{0}(\omega^{\omega})\) esiste una funzione continua \(F:\omega^{\omega}\to X\) tale che \(F^{-1}(A) = B\), ovvero \(B \in \bm{\Sigma}_{1}^{0}\). Si avrebbe quindi che ogni chiuso di \(\omega^{\omega}\) sia un clopen. Come argomentato nell'\href{../../../../../../org/roam/20250505103058-caratterizzazione_dei_punti_non_isolati_di_uno_spazio_polacco.org}{esercizio precedente}, questo genera un assurdo.
\item L'insieme \(A\) è aperto ma non chiuso se e solo se \(X\setminus A\) è chiuso ma non aperto, se e solo se \(X\setminus A\) è \(\bm{\Pi}_{1}^{0}\)-completo per il punto precedente.

Per il Lemma 2.1.23, \(X\setminus A\) è \(\bm{\Pi}_{1}^{0}\)-completo se e solo se \(A\) è \(\check{\bm{\Pi}}_{1}^{0}\)-completo, ma (per l'Example 2.1.10)
\begin{equation*}
  	\check{\bm{\Pi}}_{1}^{0}=\bm{\Sigma}_{1}^{0}
\end{equation*}
e pertanto \(A\) è aperto ma non chiuso se e solo se \(A\) è \(\bm{\Sigma}_{1}^{0}\)-completo.\qed
\end{itemize}
\section{Esercizio 3}
\label{sec:org056271b}

Prove that the sets
\begin{align*}
C_0 &= c_0 \cap [0,1]^\omega = \left\{(x_n)_{n \in \omega} \in [0,1]^\omega \,\middle|\, x_n \to 0 \right\}\\
C &= \left\{(x_n)_{n \in \omega} \in [0,1]^\omega \,\middle|\, (x_n)_{n \in \omega} \text{ converges} \right\}
\end{align*}
are both \(\bm{\Pi}^0_3\)-complete.

\emph{Hint.} For the hardness part, compare these sets with the \(\bm{\Pi}^0_3\)-complete set \(C_3\) from Exercise 2.1.27 in the notes.
\subsection{Soluzione}
\label{sec:orgf63820f}

\subsubsection{\(C_{0}\) e \(C\) sono degli insiemi \(\mathbf{\Pi}_{0}^{3}\).}
\label{sec:org02e4c78}

\begin{enumerate}
\item Insieme \(C_{0}\).
\label{sec:org92a6d31}

Si ha che \((x_{j})_{j \in \omega} \in C_{0}\) se e solo se \((x_{j})_{j \in \omega} \in [0,1]^{\omega}\) e:
\begin{equation*}
	\forall\, \varepsilon \in \Q^{+}\ \exists\,N \in \N \ \forall\, n > N\ \left( |x_{n}|\le\varepsilon\right)
\end{equation*}
ovvero, se \(U_{n, \varepsilon} \coloneqq \set{(x_{j})_{j \in \omega} \in [0,1]^{\omega}: |x_{n}|\le\varepsilon}\), allora
\begin{equation*}
	C_{0} = \bigcap_{\varepsilon \in \Q^{+}} \bigcup_{N \in \N} \bigcap_{n>N} U_{n,\varepsilon}.
\end{equation*}

Quindi, dette \(\pi_{m} : [0,1]^{\omega}\to [0,1]\) le \(m\)-esime proiezioni (continue per definizione di topologia prodotto):
\begin{equation*}
	U_{n,\varepsilon}= \pi_{n}^{-1}\left([-\varepsilon,\varepsilon]\right)
\end{equation*}
e pertanto \(U_{n,\varepsilon}\) è chiuso. Per il Lemma 2.1.5:
\begin{align*}
	\bigcap_{n > N} U_{n,\varepsilon} &\in \bm{\Pi}_{1}^{0}\\
	\bigcup_{N \in \N}\bigcap_{n >N} U_{n,\varepsilon} &\in \bm{\Sigma}_{2}^{0}\\
	C_{0} = \bigcap_{\varepsilon \in \Q^{+}} \bigcup_{N \in \N} \bigcap_{n>N} U_{n,\varepsilon} &\in \bm{\Pi}_{3}^{0}.
\end{align*}
e si ottiene che \(C_{0} \in \bm{\Pi}_{3}^{0}\left([0,1]^{\omega}\right)\).
\item Insieme \(C\).
\label{sec:orgbb6026c}

Si ha che \((x_{j})_{j \in\omega} \in C\) se e solo se \((x_{j})_{j \in\omega} \in [0,1]^{\omega}\) e
\begin{equation*}
\forall\, \varepsilon \in \Q^{+}\ \exists\, N \in \N \ \forall\,n,m> N\ (|x_{n}-x_{m}|\le\varepsilon)
\end{equation*}
ovvero, se \(V_{m,n}^{\varepsilon} \coloneqq \set{(x_{j})_{j \in \omega} \in [0,1]^{\omega}: |x_{n}-x_{m}|\le\varepsilon}\), allora
\begin{equation*}
C = \bigcap_{\varepsilon \in \Q^{+}}\bigcup_{N \in \N}\bigcap_{n,m>N} V_{n,m}^{\varepsilon}.
\end{equation*}

Poiché la funzione \((\pi_{n}-\pi_{m}):[0,1]^{\omega}\to \R\) è continua, allora
\begin{equation*}
V_{n,m}^{\varepsilon} \coloneqq (\pi_{n}-\pi_{m})^{-1}\left([-\varepsilon,\varepsilon]\right)
\end{equation*}
e quindi \(V_{n,m}^{\varepsilon}\) è chiuso. Per il Lemma 2.1.5:
\begin{align*}
\bigcap_{n,m > N} V_{n,m}^{\varepsilon} &\in \bm{\Pi}_{1}^{0}\\
\bigcup_{N \in \N}\bigcap_{n,m > N} V_{n,m}^{\varepsilon} &\in \bm{\Sigma}_{2}^{0}\\
C = \bigcap_{\varepsilon \in \Q^{+}}\bigcup_{N \in \N}\bigcap_{n,m>N} V_{n,m}^{\varepsilon} &\in \bm{\Pi}_{3}^{0}
\end{align*}
e si ottiene che \(C \in \bm{\Pi}_{3}^{0}\left([0,1]^{\omega}\right)\).
\end{enumerate}
