Esercizi/PECCIOLI_TDI_Foglio4.org
*** Hardness

È noto (Esercizio 2.1.27) che l'insieme \(C_{3} \coloneqq \set{x \in \omega^{\omega}\mid \lim_{n\to\infty}x(n) = \infty}\) sia \(\bm{\Pi}_{3}^{0}\)-hard. Pertanto si cercano delle funzioni continue
\begin{equation*}
\begin{tikzcd}[ampersand replacement=\&,cramped]
	{\omega^\omega} \& {[0,1]^\omega} \& {[0,1]^\omega}
	\arrow["F", from=1-1, to=1-2]
	\arrow["G", from=1-2, to=1-3]
\end{tikzcd}
\end{equation*}
tali che
\begin{equation*}
F^{-1}(C_{0}) = C_{3},\qquad G^{-1}(C) = C_{0}.
\end{equation*}
Questo, per mezzo del Lemma 2.1.23, garantisce che \(C_{0},C\) siano insiemi \(\bm{\Pi}_{3}^{0}\)-hard (e quindi, per il punto precedente, completi).

Le due funzioni si definiscono come segue:
\begin{align*}
&\begin{aligned}
F: \omega^{\omega} &\longrightarrow[0,1]^{\omega}\\
(x_{j})_{j \in \omega} &\longmapsto \left(\phi(x_{j})\right)_{j \in \omega}
\end{aligned} & &\text{dove} & &\begin{aligned}
\phi: \N &\longrightarrow [0,1]\\
m &\longmapsto \begin{cases}
1/m & m\neq 0\\
1 & m=0.
\end{cases}
\end{aligned}\\[1.5em]
&\begin{aligned}
G: [0,1]^{\omega} &\longrightarrow [0,1]^{\omega}\\
(x_{j})_{j \in \omega} &\longmapsto (y_{j})_{j \in \omega}
\end{aligned} & &\text{dove} &
&y_{j} \coloneqq \begin{cases}
0 & j\text{ dispari}\\
x_{j/2} & j\text{ pari}.
\end{cases}
\end{align*}

**** _\(F\) è continua._

La funzione \(F\) è continua poiché lo è su ciascuna componente (in quanto \(\N\) ha la topologia discreta).

**** _\(G\) è continua._

La funzione \(F\) è continua poiché lo è su ciascuna componente:
- la componente \(j\)-esima di \(G\), con \(j\) dispari, è data dalla funzione costante nulla, continua;
- la componente \(j\)-esima di \(G\), con \(j\) pari, è data dalla funzione proiezione \(\pi_{j/2}: [0,1]^{\omega}\to [0,1]\), continua per definizione di topologia prodotto.

**** _\(F^{-1}(C_{0})=C_{3}\)._

Si dimostra che \(\alpha \in C_{3}\) sse \(F(\alpha) \in C_{0}\).

- Se \(\alpha = (x_{j})_{j \in \omega}\in C_{3}\) allora esiste \(N \in \N\) tale che, per ogni \(j>N\) si ha\(x_{j}\neq 1\).

  Pertanto, per ogni \(j>N\), \(\phi(x_{j}) = 1/x_{j}\) e, siccome \(x_{j}\to \infty\), \(\phi(x_{j})\to 0\). Quindi \(F(\alpha) \in C_{0}\).
- Viceversa, sia \(\alpha = (x_{j})_{j \in \omega} \notin C_{3}\). Si supponga per assurdo che \((y_{j})_{j \in \omega} = F(\alpha) \in C_{0}\).

  Allora, definitivamente, \(y_{j} = 1/x_{j}\) (e in particolare \(x_{j}\neq 0\neq y_{j}\)), poiché altrimenti non si avrebbe convergenza a \(0\). In particolare, \(x_{j} = 1/y_{j}\), definitivamente:
  \begin{equation*}
	\lim_{j\to \infty} x_{j} = \lim_{j\to\infty}\frac{1}{y_{j}} = \infty
  \end{equation*}
  poiché \(y_{j}\to 0\). Quindi \((x_{j})_{j \in \omega} \in C_{3}\). Assurdo.

  Si ottiene perciò che \(F(\alpha) \notin C_{0}\).

**** _\(G^{-1}(C)=C_{0}\)._

Si dimostra che \(\alpha \in C_{0}\) sse \(G(\alpha) \in C\).

- Se \(\alpha = (x_{j})_{j \in \omega} \in C_{0}\) allora la successione \(\beta= (y_{j})_{j \in \omega} \coloneqq G(\alpha)\) converge a \(0\), e pertanto converge: \(G(\alpha) \in C\).
- Viceversa, se \(\alpha = (x_{j})_{j \in \omega}\notin C_{0}\) , allora la successione \(\beta= (y_{j})_{j \in \omega} \coloneqq G(\alpha)\) non converge, in quanto presenta due sottosuccessioni (\((y_{2j+1})_{j \in \omega}\) e \((y_{2j})_{j \in \omega}\)) con caratteri diversi: \(G(\alpha)\notin C\).\qed

* Esercizio 4

Prove that for any $0 < p < \infty$ the set
\[
\ell^p \cap [0,1]^\omega =
\set{(x_n)_{n \in \omega} \in [0,1]^\omega
\mid
\|x\|_p = \left( \sum_{n=0}^\infty |x_n|^p \right)^{1/p} < \infty}
\]
is \(\bm{\Sigma}^0_2\)-complete.

/Hint./ Recall that a series of positive terms converges if and only if the sequence of partial sums is bounded from above. For the hardness part, compare this set with the \(\bm{\Sigma}^0_2\)-complete set \(Q_2\) from the notes.

** Soluzione

*** Insieme \(\mathbf{\Sigma}^{0}_{2}\)

Sia \(x=(x_{j})_{j \in \omega} \in [0,1]^{\omega}\).

Si ha che \((x_{j})_{j \in \omega} \in \ell^{p}\cap[0,1]^{\omega}\) se e solo se
\begin{equation*}
\norma{x}_{p} = \left(\sum_{n=0}^{\infty}|x_{n}|^{p}\right)^{1/p}<\infty
\end{equation*}
se e solo se
\begin{equation*}
(\norma{x}_{p})^{p} = \sum_{n=0}^{\infty}|x_{n}|^{p} < \infty
\end{equation*}
se e solo se, sfruttando l'hint,
\begin{equation*}
\exists\, L \in \Q^{+}\ \forall\, N \in \N \ \left(\sum_{n=0}^{N} |x_{n}|^{p}\right) \le L
\end{equation*}

Sia dunque
\begin{align*}
G_{N}^{p}: [0,1]^{\omega} &\longrightarrow \R\\
(x_{j})_{j \in \omega} &\longmapsto \sum_{n=0}^{N} |x_{n}|^{p}
\end{align*}
Questa è una mappa continua, poiché composizione di mappe continue (proiezioni, continue per la definizione di topologia prodotto, e somma finita ed elevamento a potenza) e pertanto il seguente è un insieme chiuso:
\begin{equation*}
V_{L}^{N} \coloneqq \set{(x_{j})_{j \in \omega} \in [0,1]^{\omega}\mid \left(\sum_{n=0}^{N} |x_{n}|^{p}\right) \le L} = (G_{N}^{p})^{-1}\left([0,L]\right).
\end{equation*}

In definitiva
\begin{align*}
V_{L}^{N} &\in \bm{\Pi}_{1}^{0}\\
\bigcap_{N \in \N} V_{L}^{N} &\in \bm{\Pi}_{1}^{0}\\
\ell^{p}\cap[0,1]^{\omega} = \bigcup_{L \in \Q}\bigcap_{N \in \N} V_{L}^{N} &\in \bm{\Sigma}_{2}^{0}.
\end{align*}

*** Insieme \(\mathbf{\Sigma}^{0}_{2}\)-hard

È noto che l'insieme
\begin{equation*}
Q_{2}\coloneqq \set{x \in 2^{\omega}\mid
\exists\, n \in \N\ \forall\, k \ge n\ \left(x(k) = 0\right)
}
\end{equation*}
sia \(\bm{\Sigma}_{2}^{0}\)-hard.

Si vuole quindi trovare una funzione continua
\begin{equation*}
F: 2^{\omega} \longrightarrow [0,1]^{\omega}
\end{equation*}
tale che \(F^{-1}\left(\ell^{p}\cap[0,1]^{\omega}\right)=Q_{2}\). Questo, per il Lemma 2.1.23, garantisce che \(\ell^{p}\cap[0,1]^{\omega}\) sia \(\bm{\Sigma}_{2}^{0}\)-hard, e quindi \(\bm{\Sigma}_{2}^{0}\)-completo.

- Considerando che \(2=\set{0,1} \subseteq [0,1]\), si può definire \(F\) come l'inclusione, ovvero
  \begin{align*}
	F: 2^{\omega} &\longrightarrow [0,1]^{\omega}\\
	(x_{j})_{j \in \omega} &\longmapsto (x_{j})_{j \in \omega}
  \end{align*}
- Questa è una funzione continua, poiché è continua su ciascuna componente (infatti \(\set{0,1}\) ha la topologia di sottospazio rispetto a \([0,1]\), e per definizione quindi l'inclusione è continua).
- Inoltre, \(F^{-1}\left(\ell^{p}\cap[0,1]^{\omega}\right) = Q_{2}\). In particolare, si dimostra che \(\alpha \in Q_{2}\) sse \(F(\alpha) \in \ell^{p}\cap[0,1]^{\omega}\)
  - Sia \(\alpha = (x_{j})_{j \in \omega} \in Q_{2}\). Allora esiste \(N \in \N\) tale che \(x_{j}=0\) per ogni \(j>N\), e pertanto
    \begin{equation*}
		\left(\sum_{j=0}^{\infty}|x_{j}|^{p}\right)^{1/p} = \left(\sum_{j=0}^{N} |x_{j}|^{p}\right)^{1/p}<\infty
    \end{equation*}
    Pertanto \(F(\alpha) \in \ell^{p}\cap[0,1]^{\omega}\).
  - Sia \(\alpha = (x_{j})_{j \in \omega} \notin Q_{2}\). Allora per ogni \(n \in \N\) esiste \(k_{n}\ge n\) tale che \(x_{k_{n}} = 1\). Pertanto, per ogni \(n \in \N\), esiste un numero infinito di indici \(j\) tali che \(x_{j}=1\), e dunque \(\lim_{j\to\infty} x_{j}\neq 0\) e dunque la serie
    \begin{equation*}
		\sum_{j=0}^{\infty} |x_{j}|^{p}
    \end{equation*}
    diverge. Pertanto \(F(\alpha)\notin \ell^{p}\cap[0,1]^{\omega}\).\qed

* Esercizio 5

Show that the collection of all sequences $(x_n)_{n \in \omega} \in [0,1]^\omega$ having an irrational accumulation point is analytic.

