Esercizi/PECCIOLI_TDI_Foglio4.org
** Soluzione

Sia \(A_{[0,1]\setminus\Q}\) l'insieme di tutti gli \((x_{j})_{j \in \omega} \in [0,1]^{\omega} \) con un punto di accumulazione irrazionale.

Si ricorda che \(p \in [0,1]\) è un punto di accumulazione per \((x_{j})_{j \in \omega}\), per definizione, se:
\begin{equation*}
\forall\, \varepsilon > 0 \ \forall\, N \in \N\ \exists\, n > N\ \left(x_{n} \in (p-\varepsilon,p+\varepsilon)\right).
\end{equation*}

In particolare, \(p \in [0,1]\) è un punto di accumulazione per \((x_{j})_{j \in \omega}\) se e solo se:
\begin{equation*}
\forall\, \varepsilon \in \Q^{+} \ \forall\, N \in \N\ \exists\, n > N\ \left(x_{n} \in (p-\varepsilon,p +\varepsilon)\right).
\end{equation*}

Per il Remark 3.1.10, quindi, siccome \([0,1]\setminus \Q\) è uno spazio polacco, \(A_{[0,1]\setminus \Q}\) è un insieme analitico, in quanto definito dalla seguente formula:
\begin{equation*}
\exists\, p \in [0,1]\setminus \Q\ \forall\, \varepsilon \in \Q^{+} \ \forall\, N \in \N\ \exists\, n > N\ \left(x_{n} \in (p-\varepsilon,p +\varepsilon)\right)
\end{equation*}
composta unicamente (tranne che per il primo esistenziale), da quantificazioni numerabili, e da una formula atomica: \(x_{n} \in (p-\varepsilon,p+\varepsilon)\), che definisce un boreliano di \(([0,1]\setminus \Q)\times [0,1]^{\omega}\), in quanto, data la funzione continua
\begin{align*}
F_{n}: ([0,1]\setminus \Q)\times [0,1]^{\omega}  &\longrightarrow \R\\
\left(p,(x_{j})_{j \in \omega}\right) &\longmapsto x_{n}-p
\end{align*}
si ha che
\begin{equation*}
\set{\left(p,(x_{j})_{j \in \omega}\right) \in ([0,1]\setminus \Q)\times [0,1]^{\omega}\mid x_{n} \in (p-\varepsilon,p+\varepsilon)} = F_{n}^{-1}\left[(-\varepsilon,\varepsilon)\right]
\end{equation*}
è un aperto.\qed

# Sia dunque \(V_{p,\varepsilon}^{n} \coloneqq \set{\left(p,(x_{j})_{j \in \omega}\right) \in ([0,1]\setminus \Q)\times([0,1]^{\omega})\mid x_{n} \in (p-\varepsilon,p+\varepsilon) } = \set{p}\times(\pi_{n})^{-1}\left[[p-\varepsilon,p+\varepsilon]\right]\). Questo è un insieme chiuso.

# Pertanto l'insieme di tutte le successioni di \([0,1]^{\omega}\) aventi come punto di accumulazione \(p \in [0,1]\) è un boreliano, in quanto è il seguente insieme:
# \begin{equation*}
# \bigcap_{\varepsilon \in \Q^{+}}\bigcap_{N \in \N}\bigcup_{n > N} V_{p,\varepsilon}^{n}
# \end{equation*}
